#include <stdio.h>

void DrawBoard();

void main()
{
	DrawBoard();
	return;
}

void DrawBoard() 
{
	system("cls");   //ÇåÆÁ
	printf("  ==Welcome to FiveInRow Game==\n\n\n" );


	printf("15©³©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©· \n");
	printf("14©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("13©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("12©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("11©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("10©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("9 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("8 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("7 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("6 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("5 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("4 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("3 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("2 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("1 ©»©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©¿ \n");

	printf("   A B C D E F G H I J K L M N O \n");
	system("pause");
}