#include <stdio.h>
#include<string.h>
void DrawBoard();

void main()
{
	DrawBoard();
	return;
}

void DrawBoard()
{
	system("cls");   //ÇåÆÁ
	printf("  ==Welcome to FiveInRow Game==\n\n\n");


	printf("15©³©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©Ó©· \n");
	printf("14©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("13©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("12©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("11©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("10©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("9 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("8 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("7 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("6 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("5 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("4 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("3 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("2 ©Ä©à©à©à©à©à©à©à©à©à©à©à©à©à©Ì \n");
	printf("1 ©»©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©Û©¿ \n");

	printf("   A B C D E F G H I J K L M N O \n");

	char board [15][31][2] = 
	{
		{"©³","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©·"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì"},
		{"©»","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©¿"}

	};
	board[2][2][1] = (char)9;
	//char white[2] = "¡ò";
	printf("%d", strlen("©à"));
	for (int i = 0; i < 15; i++)
	{
		for (int j = 0; j < 30; j++)
		{
			for (int k = 0; k < 2; k++)
				putchar(board[i][j][k]);
		}
		putchar('\n');
	}
	//system("pause");
}