#include<stdio.h>
#include<string.h>

/*
void chess_play(char board[][17][2])
{
	int raw, column;
	char black[2] = "¡ð";
	char white[2] = "¡ñ";
	printf("INPUT:\n");
	scanf("%d %d", &raw, &column);
	strncpy(board[raw][column], black, 2);
}
*/


int main()
{
	
/*

	char board[15][17][2] =
	{
		{"15","©³","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©Ó","©·","15"},
		{"14","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","14"},
		{"13","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","13"},
		{"12","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","12"},
		{"11","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","11"},
		{"10","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","10"},
		{"9","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","9"},
		{"8","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","8"},
		{"7","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","7"},
		{"6","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","6"},
		{"5","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","5"},
		{"4","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","4"},
		{"3","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","3"},
		{"2","©Ä","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©à","©Ì","2"},
		{"1","©»","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©Û","©¿","1"}

	};

	char black[2] = "¡ð";
	char white[2] = "¡ñ";

	int i,j,k;
	int raw = 2;
	int column = 2;
	strncpy(board[raw][column], black, 2);
//	chess_play(**board);

	for ( i = 0; i < 15; i++)
	{
		for ( j = 0; j < 17; j++)
		{
			for ( k = 0; k < 2; k++)
				putchar(board[i][j][k]);
		}
		putchar('\n');

	}

	if (strncmp(board[raw][column], black, 2)==0||strcmp(board[raw][column], white, 2) == 0)
		printf("error");

	printf("%d", strcmp("ABCD", "ABCD") );
	printf("%d", strcmp(board[raw][column], "¡ñ") );
	printf(board[raw][column]);
*/
	int i;
	int index;
	int index2;
	index = scanf("%d" ,&i);
	printf("index = %d\n", index);
	index2 = (index!=1);
	printf("index2 = %d\n", index2);
	while ((1 >= i || 15 <= i) && (index2))
	{
		printf("error\n");
		fflush(stdin);
		index = scanf("%d" ,&i);
		printf("index = %d\n", index);
		index2 = (index!=1);
		printf("index2 = %d\n", index2);

	}	
	system("pause");

	return 0;

}